a=int(input('γραψε εναν ακεραιο αριθμο ', ))
b=int(input('γραψε εναν ακομη ακεραιο αριθμο ', ))

if a==b:
      print('ειναι ισοι')
elif a>b:
    print('ο a ειναι μεγαλυτεροσ')
else:
    print('ο b ειναι μεγαλυτεροσ')

print('επισης')

if a%2==0 and b%2==0:
    print('και οι δυο ειναι αρτιοι')
elif a%2==0 and b%2!=0:
    print('ο a ειναι αρτιος και ο b ειναι περιττος')
elif a%2!=0 and b%2==0:
    print('ο b ειναι αρτιος και ο a ειναι περιττος')
else:
    print('και οι δυο ειναι περιττοι')

print('επομενως εχουμε τους αριθμους a=',a,'και b=',b,'.')
c=int(input('γραψε εναν τελευταιο ακεραιο αριθμο ', ))

print('με τους αριθμους αυτους θεωρω το πολυωνυμο',a,"x^2+",b,"x+",c,'.')
print('και θελω να βρω τις ριζες του')
D=(b*b)+(4*a*c)
print("η υποτεινουσα ειναι ",D,".")
πρωτη=((b*(-1))+(D**0.5))/(a*a)
δευτερη=((b*(-1))-(D**0.5))/(a*a)
μοναδικη=(b*(-1))/(a*a)

if D>0:
    print("η πρωτη ριζα ειναι η x1=",πρωτη,"και η δευτερη ειναι η x2=",δευτερη,".")
elif D==0:
    print("εχει μοναδικη ριζα το x0=",μοναδικη,".")
else:
    print("η εξισωση δεν εχει ριζες")
